// the_love_from_whd.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//

#include <iostream>
#include<vector>
#include"MyRend.h"
using namespace std;

int main()
{
	//像点坐标
	/*double ICP[4][2] = { -86.15,-68.99,
						-53.40,82.21,
						-14.78,-76.63,
						10.46,64.43
	};*/
	//地面点坐标
	/*double GCP[4][3] = { {36589.41, 25273.32,2195.17},
		{37631.08,31324.51,728.69},
		{39100.97,24934.98,2386.50},
		{40426.54,30319.81,757.31}
	};*/
	vector<vector<double>> icp{ 
		{-86.15, -68.99},
		{ -53.40, 82.21 },
		{ -14.78, -76.63 },
		{ 10.46, 64.43 }
	};
	vector<vector<double>> gcp{ 
		{36589.41, 25273.32, 2195.17},
		{ 37631.08,31324.51,728.69 },
		{ 39100.97,24934.98,2386.50 },
		{ 40426.54,30319.81,757.31 }
	};


	double f = 0.15324;
	Rend neu(icp, gcp, f);
    
	return 0;
    
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
